Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element
This structure is used to hold number and distance data.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element.number
The number of bars.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element.distance
The distance between the bars.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element.#ctor(System.Int32,System.Double)
Initializes a new instance of the Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element struct.
number: The number of spaces.
distance: The spacing distance.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element.Number
Gets or sets the number of spaces in the element.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element.Distance
Gets or sets the spacing distance in the element.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element.FromStruct(Tekla.Structures.ModelInternal.dotSpacingElement_t)
Creates a new element from the dot struct instance.
dotElement: The dot struct.
Returns: A new instance of a Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Element.ToStruct
Creates a new dot element.
Returns: A new instance of a Tekla.Structures.ModelInternal.dotSpacingElement_t.